package com.it.array;

public class ArrayDemo01 {
    public static void main(String[] args) {
        //需求：班级有10人 每个人都有一个成绩
        int zhangsan = 80;
        int list = 90;

        //使用数组形式进行定义
        //数组的基本格式：数据类型[] 数组名称
        //创建一个数组：
        //1.直接赋值的方式
        //数据类型[] 数组名称 = [1,2,3,4,5,6];
        //数据类型[] 数组名称 = new 数组类型[];
        //定义值
        int[] classes = {50,60,70,67,78,89,91,92,93,99};
        int[] classes1 = new int[]{50,60,70,67,78,89,91,92,93,99};

        //1.数组的基本格式

        //2.数组初始化的方式（给数组进行赋值）
        //动态初始化（指定数组的长度）
        //数据类型[]

    }
}
